<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>IKEv2</key>
			<dict>
				<key>AuthenticationMethod</key>
				<string>Certificate</string>
				<key>ChildSecurityAssociationParameters</key>
				<dict>
					<key>DiffieHellmanGroup</key>
					<integer>14</integer>
					<key>EncryptionAlgorithm</key>
					<string>AES-256-GCM</string>
					<key>IntegrityAlgorithm</key>
					<string>SHA2-512</string>
					<key>LifeTimeInMinutes</key>
					<integer>1440</integer>
				</dict>
				<key>DeadPeerDetectionRate</key>
				<string>Low</string>
				<key>DisableMOBIKE</key>
				<integer>0</integer>
				<key>DisableRedirect</key>
				<integer>0</integer>
				<key>EnableCertificateRevocationCheck</key>
				<integer>0</integer>
				<key>EnablePFS</key>
				<true/>
				<key>IKESecurityAssociationParameters</key>
				<dict>
					<key>DiffieHellmanGroup</key>
					<integer>14</integer>
					<key>EncryptionAlgorithm</key>
					<string>AES-256-GCM</string>
					<key>IntegrityAlgorithm</key>
					<string>SHA2-512</string>
					<key>LifeTimeInMinutes</key>
					<integer>1440</integer>
				</dict>
				<key>LocalIdentifier</key>
				<string><%= @vpn_client -%>@<%= @vpn_name -%></string>
				<key>PayloadCertificateUUID</key>
				<string><%= @uuid_payload_pkcs12 -%></string>
				<key>RemoteAddress</key>
				<string><%= @vpn_name -%></string>
				<key>RemoteIdentifier</key>
				<string><%= @vpn_name -%></string>
				<key>UseConfigurationAttributeInternalIPSubnet</key>
				<integer>0</integer>
			</dict>
			<key>IPv4</key>
			<dict>
				<key>OverridePrimary</key>
				<integer>1</integer>
			</dict>
			<key>PayloadDescription</key>
			<string>Configures VPN settings</string>
			<key>PayloadDisplayName</key>
			<string>VPN</string>
			<key>PayloadIdentifier</key>
			<string>com.apple.vpn.managed.<%= @uuid_payload_vpnconfig -%></string>
			<key>PayloadType</key>
			<string>com.apple.vpn.managed</string>
			<key>PayloadUUID</key>
			<string><%= @uuid_payload_vpnconfig -%></string>
			<key>PayloadVersion</key>
			<real>1</real>
			<key>Proxies</key>
			<dict>
				<key>HTTPEnable</key>
				<integer>0</integer>
				<key>HTTPSEnable</key>
				<integer>0</integer>
			</dict>
			<key>UserDefinedName</key>
			<string><%= @vpn_name %></string>
			<key>VPNType</key>
			<string>IKEv2</string>
<% if @ondemand_connect -%>
			<key>OnDemandEnabled</key>
			<integer>1</integer>
			<key>OnDemandRules</key>
			<array>
<% if @ondemand_ssid_excudes -%>
				<dict>
					<key>Action</key>
					<string>Disconnect</string>
					<key>SSIDMatch</key>
					<array>
<% @ondemand_ssid_excludes.each do |ssid| -%>
						<string><%= @ssid %></string>
<% end -%>
					</array>
				</dict>
<% end -%>
				<dict>
					<key>Action</key>
					<string>Connect</string>
				</dict>
			</array>
<% end -%>
		</dict>
		<dict>
			<key>PayloadCertificateFileName</key>
			<string><%= @vpn_name -%>_ca.der</string>
			<key>PayloadContent</key>
			<data>
			%%CERT_CA_DER%%
			</data>
			<key>PayloadDescription</key>
			<string>Adds a CA root certificate</string>
			<key>PayloadDisplayName</key>
			<string><%= @vpn_name -%> CA</string>
			<key>PayloadIdentifier</key>
			<string>com.apple.security.root.<%= @uuid_payload_cacert -%></string>
			<key>PayloadType</key>
			<string>com.apple.security.root</string>
			<key>PayloadUUID</key>
			<string><%= @uuid_payload_cacert -%></string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>Password</key>
			<string><%= @cert_password -%></string>
			<key>PayloadCertificateFileName</key>
			<string><%= @vpn_client -%>.p12</string>
			<key>PayloadContent</key>
			<data>
			%%CERT_PKCS12%%
			</data>
			<key>PayloadDescription</key>
			<string>Adds a PKCS#12-formatted certificate</string>
			<key>PayloadDisplayName</key>
			<string><%= @vpn_client -%>.p12</string>
			<key>PayloadIdentifier</key>
			<string>com.apple.security.pkcs12.<%= @uuid_payload_pkcs12 -%></string>
			<key>PayloadType</key>
			<string>com.apple.security.pkcs12</string>
			<key>PayloadUUID</key>
			<string><%= @uuid_payload_pkcs12 -%></string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Mobile device VPN package</string>
	<key>PayloadDisplayName</key>
	<string><%= @vpn_name -%></string>
	<key>PayloadIdentifier</key>
	<string><%= @uuid_payload_id -%></string>
	<key>PayloadOrganization</key>
	<string><%= @vpn_name -%></string>
	<key>PayloadRemovalDisallowed</key>
	<false/>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string><%= @uuid_payload_uuid -%></string>
	<key>PayloadVersion</key>
	<integer>1</integer>
</dict>
</plist>
